Config/Reports/ЖурналУчетаРасчетныхДокументовБезПримененияККТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЖурналУчетаРасчетныхДокументовБезПримененияККТ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиТитульныеЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавлятьВГрафуПримечаниеДокументОснование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФискальныеРегистраторы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Enums/СтатусыЧековККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЧековККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отложенный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулированный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробитый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архивный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ЧекККМНаПередачу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЧекККМНаПередачу</Name>
			<BasedOn>
				<xr:Item>Document.АктОбОказанииУслуг</xr:Item>
				<xr:Item>Document.НакладнаяНаРеализациюТорг12</xr:Item>
				<xr:Item>Document.НакладнаяНаОтпускМ15</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФискальныеРегистраторы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЧекаККМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЧековККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСменыККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧекаККМ</Name>
					<Comment>Номер фискального документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРасчетаДенежнымиСредствами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыДоговораПлатежногоАгента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыДоговораПлатежногоАгента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаНалогообложенияЧекаККМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСистемыНалогообложенияЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПередачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказКлиентаОтСохраненияТелефонаEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправительныйЧекККМ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМИсправительный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетВИнтернете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыЧекаККМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснованиеЧекаККМ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.КвитанцияНаОплатуГосуслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.НакладнаяНаРеализациюТорг12</v8:Type>
								<v8:Type>cfg:DocumentRef.НакладнаяНаОтпускМ15</v8:Type>
								<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
								<v8:Type>cfg:DocumentRef.АктОбОказанииУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакСпособаРасчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПризнакиСпособаРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПредоплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВстречногоПредоставления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Reports/ЖурналУчетаРасчетныхДокументовБезПримененияККТ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

Процедура СформироватьОтчет(ЖурналУчета, ТитульныеЛисты) Экспорт
	СформироватьЖурналУчета(ЖурналУчета);
	СформироватьТитульныйЛист(ТитульныеЛисты);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

 // Процедура формирует журнал учета в переданный табличный документ
 //
 // Параметры
 //  ЖурналУчета  - ТабличныйДокумент - табличный документ, в который
 //                 формируется журнал учета
 //
Процедура СформироватьЖурналУчета(ЖурналУчета)
	ЖурналУчета.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ЖурналУчета.АвтоМасштаб = Истина;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаОтбора", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаОкончанияОтбора", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КассаККМ", КассаККМ);
	
	Запрос.Текст = ЗапросДанныхОРасчетныхДокументахБезККТ();
	
	ВыборкаРасчетныеДокументы = Запрос.Выполнить().Выбрать();
	
	ЖурналУчета.Очистить();
	
	МаксимальноеКоличествоСтрокНаСтранице = 19;
	
	КоличествоСтрокОтчета = ВыборкаРасчетныеДокументы.Количество();
	
	КоличествоСтрокНаСтранице = 0;
	
	Макет = ПолучитьМакет("Журнал");
	ПерваяСтрока = Истина;
	
	Пока ВыборкаРасчетныеДокументы.Следующий() Цикл
		ОблСтрока = Макет.ПолучитьОбласть("Строка");
		
		Если НЕ ПерваяСтрока Тогда
			Если КоличествоСтрокНаСтранице>(МаксимальноеКоличествоСтрокНаСтранице-1) Тогда
				//вывод шапки
				ЖурналУчета.ВывестиГоризонтальныйРазделительСтраниц();
				ОблШапка = Макет.ПолучитьОбласть("Шапка");
				ЖурналУчета.Вывести(ОблШапка);
				
				КоличествоСтрокНаСтранице = 0;
			КонецЕсли;	
		Иначе
			ОблШапка = Макет.ПолучитьОбласть("Шапка");
			ЖурналУчета.Вывести(ОблШапка);
			
			ПерваяСтрока = Ложь;
		КонецЕсли;
		
		ОблСтрока.Параметры.Заполнить(ВыборкаРасчетныеДокументы);
		Если ДобавлятьВГрафуПримечаниеДокументОснование Тогда
			Если ВыборкаРасчетныеДокументы.ВидДокументаОснования =
				НСтр("ru = 'Фискальная операция'") Тогда
				ОблСтрока.Параметры.Примечание = Строка(ВыборкаРасчетныеДокументы.ДокументОснование);
			Иначе	
				ОблСтрока.Параметры.Примечание = СокрЛП(ВыборкаРасчетныеДокументы.ВидДокументаОснования) + " от " +  СокрЛП(ВыборкаРасчетныеДокументы.ДатаДокументаОснования) + " № "+ СокрЛП(ВыборкаРасчетныеДокументы.НомерДокументаОснования);
			КонецЕсли;	
		КонецЕсли;
		
		ЖурналУчета.Вывести(ОблСтрока);
		
		КоличествоСтрокНаСтранице = КоличествоСтрокНаСтранице + 1;
	КонецЦикла;	
	
	ОблПодвал = Макет.ПолучитьОбласть("Подвал");
	ЖурналУчета.Вывести(ОблПодвал);
	
КонецПроцедуры

 // Процедура формирует титульный лист в переданный табличный документ
 //
 // Параметры
 //  ЖурналУчета  - ТабличныйДокумент - табличный документ, в который
 //                 формируется титульный лист
 //
Процедура СформироватьТитульныйЛист(ТитульныеЛисты)
	ТитульныеЛисты.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТитульныеЛисты.АвтоМасштаб = Истина;
	ТитульныеЛисты.Очистить();
	
	Макет = ПолучитьМакет("ТитульныйЛист");
	
	Обл = Макет.ПолучитьОбласть("ТитульныйЛистШапка");
	СведенияОбОрганизации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "НаименованиеПолное, КодОКПО");
	Обл.Параметры.пОрганизация = СведенияОбОрганизации.НаименованиеПолное;
	Обл.Параметры.пКодОКПО     = СведенияОбОрганизации.КодОКПО;
	ТитульныеЛисты.Вывести(Обл);
	
	Обл = Макет.ПолучитьОбласть("ТитульныйЛист");
	
	СведенияОЖурнале = Новый Структура;
	СведенияОЖурнале.Вставить("СтрокаПериода");
	СведенияОЖурнале.Вставить("АдресРасчетов");
	СведенияОЖурнале.Вставить("МестоРасчетов");
	
	СведенияОЖурнале.СтрокаПериода = "за "+ Нрег(ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(КонецПериода), "ФП"));
	СведенияОЖурнале.АдресРасчетов = КассаККМ.АдресМестаРасчета;
	СведенияОЖурнале.МестоРасчетов = КассаККМ.НаименованиеМестаРасчета;
	
	Обл.Параметры.Заполнить(СведенияОЖурнале);
	
	ТитульныеЛисты.Вывести(Обл);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ 

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Отказ=Истина;
		ТекстСообщения = НСтр("ru = 'Необходимо заполнить реквизит ""Организация""!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Отчет.Организация",, Отказ)
	КонецЕсли;
	Если Не ЗначениеЗаполнено(КассаККМ) Тогда
		Отказ=Истина;
		ТекстСообщения = НСтр("ru = 'Необходимо заполнить реквизит ""Касса ККМ""!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Отчет.КассаККМ",, Отказ)
	КонецЕсли;
	Если НачалоПериода > КонецПериода 
		И Не КонецПериода = '00010101' Тогда
		ТекстСообщения = НСтр("ru = 'Неправильно задан период формирования отчета!
		                             |Дата начала больше даты окончания периода.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Отчет.НачалоПериода",, Отказ);
	КонецЕсли;
КонецПроцедуры

Функция ЗапросДанныхОРасчетныхДокументахБезККТ()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ФискальныеОперации.ДокументОснование КАК ДокументОснование,
	|	ФискальныеОперации.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ФискальныеОперации.Дата КАК ДатаЧекаККМ,
	|	ФискальныеОперации.Организация КАК Организация,
	|	""Фискальная операция"" КАК ВидДокументаОснования,
	|	ФискальныеОперации.Дата КАК ДатаДокументаОснования,
	|	ФискальныеОперации.НомерЧекаККМ КАК НомерДокументаОснования,
	|	ФискальныеОперации.ДокументОснование.СистемаНалогообложенияЧекаККМ КАК СНО,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ФискальныеОперации.ДокументОснование) = ТИП(Документ.ЭквайринговаяОперация)
	|			ТОГДА ФискальныеОперации.ДокументОснование.ФискальныйРегистратор
	|		ИНАЧЕ ФискальныеОперации.ДокументОснование.КассаККМ
	|	КОНЕЦ КАК КассаККМ,
	|	ФискальныеОперации.ТипРасчета КАК ТипРасчета,
	|	ФискальныеОперации.ДокументОснование.Контрагент КАК Контрагент,
	|	"""" КАК Договор,
	|	ФискальныеОперации.Сумма КАК СуммаДокумента
	|ПОМЕСТИТЬ ВсеФискальныеОперации
	|ИЗ
	|	РегистрСведений.ФискальныеОперации КАК ФискальныеОперации
	|ГДЕ
	|	ФискальныеОперации.Организация = &Организация
	|	И ФискальныеОперации.Дата МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеФискальныеОперации.ДокументОснование КАК ДокументОснование,
	|	ВсеФискальныеОперации.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ВсеФискальныеОперации.ДатаЧекаККМ КАК ДатаЧекаККМ,
	|	ВсеФискальныеОперации.Организация КАК Организация,
	|	ВсеФискальныеОперации.ВидДокументаОснования КАК ВидДокументаОснования,
	|	ВсеФискальныеОперации.ДатаДокументаОснования КАК ДатаДокументаОснования,
	|	ВсеФискальныеОперации.НомерДокументаОснования КАК НомерДокументаОснования,
	|	ВсеФискальныеОперации.СНО КАК СНО,
	|	ВсеФискальныеОперации.КассаККМ КАК КассаККМ,
	|	ВсеФискальныеОперации.ТипРасчета КАК ТипРасчета,
	|	ВсеФискальныеОперации.Контрагент КАК Контрагент,
	|	ВсеФискальныеОперации.Договор КАК Договор,
	|	ВсеФискальныеОперации.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ ФискальныеОперацииКассыККМ
	|ИЗ
	|	ВсеФискальныеОперации КАК ВсеФискальныеОперации
	|ГДЕ
	|	ВсеФискальныеОперации.КассаККМ = &КассаККМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриходныйКассовыйОрдер.Ссылка КАК Ссылка,
	|	ПриходныйКассовыйОрдер.НомерЧекаККМ КАК НомерЧекаККМ,
	|	ПриходныйКассовыйОрдер.ДатаЧекаККМ КАК ДатаЧекаККМ,
	|	ПриходныйКассовыйОрдер.Организация КАК Организация,
	|	""Приходный кассовый ордер"" КАК ВидДокументаОснования,
	|	ПриходныйКассовыйОрдер.Дата КАК ДатаДокументаОснования,
	|	ПриходныйКассовыйОрдер.Номер КАК НомерДокументаОснования,
	|	ПриходныйКассовыйОрдер.СистемаНалогообложенияЧекаККМ КАК СНО,
	|	ПриходныйКассовыйОрдер.КассаККМ КАК КассаККМ,
	|	ПриходныйКассовыйОрдер.ТипРасчета КАК ТипРасчета,
	|	ПриходныйКассовыйОрдер.Контрагент КАК Контрагент,
	|	ПриходныйКассовыйОрдер.Договор КАК Договор,
	|	ПриходныйКассовыйОрдер.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ СведенияОРасчетныхДокументах
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.Организация В(&Организация)
	|	И ПриходныйКассовыйОрдер.КассаККМ В(&КассаККМ)
	|	И ПриходныйКассовыйОрдер.ДатаЧекаККМ МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И ПриходныйКассовыйОрдер.ПометкаУдаления = ЛОЖЬ
	|	И ПриходныйКассовыйОрдер.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Ссылка,
	|	РасходныйКассовыйОрдер.НомерЧекаККМ,
	|	РасходныйКассовыйОрдер.ДатаЧекаККМ,
	|	РасходныйКассовыйОрдер.Организация,
	|	""Расходный кассовый ордер"",
	|	РасходныйКассовыйОрдер.Дата,
	|	РасходныйКассовыйОрдер.Номер,
	|	РасходныйКассовыйОрдер.СистемаНалогообложенияЧекаККМ,
	|	РасходныйКассовыйОрдер.КассаККМ,
	|	РасходныйКассовыйОрдер.ТипРасчета,
	|	РасходныйКассовыйОрдер.Контрагент,
	|	РасходныйКассовыйОрдер.Договор,
	|	РасходныйКассовыйОрдер.СуммаДокумента
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|ГДЕ
	|	РасходныйКассовыйОрдер.Организация В(&Организация)
	|	И РасходныйКассовыйОрдер.КассаККМ В(&КассаККМ)
	|	И РасходныйКассовыйОрдер.ДатаЧекаККМ МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И РасходныйКассовыйОрдер.ПометкаУдаления = ЛОЖЬ
	|	И РасходныйКассовыйОрдер.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЭквайринговаяОперация.Ссылка,
	|	ЭквайринговаяОперация.НомерЧекаККМ,
	|	ЭквайринговаяОперация.ДатаЧекаККМ,
	|	ЭквайринговаяОперация.Организация,
	|	""Эквайринговая операция"",
	|	ЭквайринговаяОперация.Дата,
	|	ЭквайринговаяОперация.Номер,
	|	ЭквайринговаяОперация.СистемаНалогообложенияЧекаККМ,
	|	ЭквайринговаяОперация.ФискальныйРегистратор,
	|	ЭквайринговаяОперация.ТипРасчета,
	|	ЭквайринговаяОперация.Контрагент,
	|	ЭквайринговаяОперация.Договор,
	|	ЭквайринговаяОперация.СуммаДокумента
	|ИЗ
	|	Документ.ЭквайринговаяОперация КАК ЭквайринговаяОперация
	|ГДЕ
	|	ЭквайринговаяОперация.Организация В(&Организация)
	|	И ЭквайринговаяОперация.ФискальныйРегистратор В(&КассаККМ)
	|	И ЭквайринговаяОперация.ДатаЧекаККМ МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И ЭквайринговаяОперация.ПометкаУдаления = ЛОЖЬ
	|	И ЭквайринговаяОперация.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМ.Ссылка,
	|	ЧекККМ.НомерЧекаККМ,
	|	ЧекККМ.Дата,
	|	ЧекККМ.Организация,
	|	""Чек ККМ"",
	|	ЧекККМ.Дата,
	|	ЧекККМ.Номер,
	|	ЧекККМ.СистемаНалогообложенияЧекаККМ,
	|	ЧекККМ.КассаККМ,
	|	ЧекККМ.ТипРасчета,
	|	ЧекККМ.Контрагент,
	|	ЧекККМ.Договор,
	|	ЧекККМ.СуммаДокумента
	|ИЗ
	|	Документ.ЧекККМ КАК ЧекККМ
	|ГДЕ
	|	ЧекККМ.Организация В(&Организация)
	|	И ЧекККМ.КассаККМ В(&КассаККМ)
	|	И ЧекККМ.Дата МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И ЧекККМ.ПометкаУдаления = ЛОЖЬ
	|	И ЧекККМ.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМНаВозврат.Ссылка,
	|	ЧекККМНаВозврат.НомерЧекаККМ,
	|	ЧекККМНаВозврат.Дата,
	|	ЧекККМНаВозврат.Организация,
	|	""Чек ККМ на возврат"",
	|	ЧекККМНаВозврат.Дата,
	|	ЧекККМНаВозврат.Номер,
	|	ЧекККМНаВозврат.СистемаНалогообложенияЧекаККМ,
	|	ЧекККМНаВозврат.КассаККМ,
	|	ЧекККМНаВозврат.ТипРасчета,
	|	ЧекККМНаВозврат.Контрагент,
	|	ЧекККМНаВозврат.Договор,
	|	ЧекККМНаВозврат.СуммаДокумента
	|ИЗ
	|	Документ.ЧекККМНаВозврат КАК ЧекККМНаВозврат
	|ГДЕ
	|	ЧекККМНаВозврат.Организация В(&Организация)
	|	И ЧекККМНаВозврат.КассаККМ В(&КассаККМ)
	|	И ЧекККМНаВозврат.Дата МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И ЧекККМНаВозврат.ПометкаУдаления = ЛОЖЬ
	|	И ЧекККМНаВозврат.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМНаПередачу.Ссылка,
	|	ЧекККМНаПередачу.НомерЧекаККМ,
	|	ЧекККМНаПередачу.Дата,
	|	ЧекККМНаПередачу.Организация,
	|	""Чек ККМ на передачу"",
	|	ЧекККМНаПередачу.Дата,
	|	ЧекККМНаПередачу.Номер,
	|	ЧекККМНаПередачу.СистемаНалогообложенияЧекаККМ,
	|	ЧекККМНаПередачу.КассаККМ,
	|	ЧекККМНаПередачу.ТипРасчета,
	|	ЧекККМНаПередачу.Контрагент,
	|	ЧекККМНаПередачу.Договор,
	|	ЧекККМНаПередачу.СуммаДокумента
	|ИЗ
	|	Документ.ЧекККМНаПередачу КАК ЧекККМНаПередачу
	|ГДЕ
	|	ЧекККМНаПередачу.Организация В(&Организация)
	|	И ЧекККМНаПередачу.КассаККМ В(&КассаККМ)
	|	И ЧекККМНаПередачу.Дата МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И ЧекККМНаПередачу.ПометкаУдаления = ЛОЖЬ
	|	И ЧекККМНаПередачу.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КассовоеПоступление.Ссылка,
	|	КассовоеПоступление.НомерЧекаККМ,
	|	КассовоеПоступление.ДатаЧекаККМ,
	|	КассовоеПоступление.Организация,
	|	""Кассовое поступление"",
	|	КассовоеПоступление.Дата,
	|	КассовоеПоступление.Номер,
	|	КассовоеПоступление.СистемаНалогообложенияЧекаККМ,
	|	КассовоеПоступление.КассаККМ,
	|	КассовоеПоступление.ТипРасчета,
	|	КассовоеПоступление.Контрагент,
	|	"""",
	|	КассовоеПоступление.СуммаДокумента
	|ИЗ
	|	Документ.КассовоеПоступление КАК КассовоеПоступление
	|ГДЕ
	|	КассовоеПоступление.Организация = &Организация
	|	И КассовоеПоступление.КассаККМ = &КассаККМ
	|	И КассовоеПоступление.Дата МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И КассовоеПоступление.ПометкаУдаления = ЛОЖЬ
	|	И КассовоеПоступление.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	КассовоеВыбытие.Ссылка,
	|	КассовоеВыбытие.НомерЧекаККМ,
	|	КассовоеВыбытие.ДатаЧекаККМ,
	|	КассовоеВыбытие.Организация,
	|	""Кассовое выбытие"",
	|	КассовоеВыбытие.Дата,
	|	КассовоеВыбытие.Номер,
	|	КассовоеВыбытие.СистемаНалогообложенияЧекаККМ,
	|	КассовоеВыбытие.КассаККМ,
	|	КассовоеВыбытие.ТипРасчета,
	|	КассовоеВыбытие.Контрагент,
	|	"""",
	|	КассовоеВыбытие.СуммаДокумента
	|ИЗ
	|	Документ.КассовоеВыбытие КАК КассовоеВыбытие
	|ГДЕ
	|	КассовоеВыбытие.Организация = &Организация
	|	И КассовоеВыбытие.КассаККМ = &КассаККМ
	|	И КассовоеВыбытие.Дата МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И КассовоеВыбытие.ПометкаУдаления = ЛОЖЬ
	|	И КассовоеВыбытие.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаВозврат.Ссылка,
	|	ЗаявкаНаВозврат.НомерЧекаККМ,
	|	ЗаявкаНаВозврат.ДатаЧекаККМ,
	|	ЗаявкаНаВозврат.Организация,
	|	""Заявка на возврат"",
	|	ЗаявкаНаВозврат.Дата,
	|	ЗаявкаНаВозврат.Номер,
	|	ЗаявкаНаВозврат.СистемаНалогообложенияЧекаККМ,
	|	ЗаявкаНаВозврат.КассаККМ,
	|	ЗаявкаНаВозврат.ТипРасчета,
	|	ЗаявкаНаВозврат.Контрагент,
	|	ЗаявкаНаВозврат.Договор,
	|	ЗаявкаНаВозврат.СуммаДокумента
	|ИЗ
	|	Документ.ЗаявкаНаВозврат КАК ЗаявкаНаВозврат
	|ГДЕ
	|	ЗаявкаНаВозврат.Организация = &Организация
	|	И ЗаявкаНаВозврат.КассаККМ = &КассаККМ
	|	И ЗаявкаНаВозврат.Дата МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И ЗаявкаНаВозврат.ПометкаУдаления = ЛОЖЬ
	|	И ЗаявкаНаВозврат.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаКассовыйРасход.Ссылка,
	|	ЗаявкаНаКассовыйРасход.НомерЧекаККМ,
	|	ЗаявкаНаКассовыйРасход.ДатаЧекаККМ,
	|	ЗаявкаНаКассовыйРасход.Организация,
	|	""Заявка на кассовый расход"",
	|	ЗаявкаНаКассовыйРасход.Дата,
	|	ЗаявкаНаКассовыйРасход.Номер,
	|	ЗаявкаНаКассовыйРасход.СистемаНалогообложенияЧекаККМ,
	|	ЗаявкаНаКассовыйРасход.КассаККМ,
	|	ЗаявкаНаКассовыйРасход.ТипРасчета,
	|	ЗаявкаНаКассовыйРасход.Контрагент,
	|	ЗаявкаНаКассовыйРасход.Договор,
	|	ЗаявкаНаКассовыйРасход.СуммаДокумента
	|ИЗ
	|	Документ.ЗаявкаНаКассовыйРасход КАК ЗаявкаНаКассовыйРасход
	|ГДЕ
	|	ЗаявкаНаКассовыйРасход.Организация = &Организация
	|	И ЗаявкаНаКассовыйРасход.КассаККМ = &КассаККМ
	|	И ЗаявкаНаКассовыйРасход.Дата МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И ЗаявкаНаКассовыйРасход.ПометкаУдаления = ЛОЖЬ
	|	И ЗаявкаНаКассовыйРасход.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаКассовыйРасход.Ссылка,
	|	ЗаявкаНаКассовыйРасход.НомерЧекаККМ,
	|	ЗаявкаНаКассовыйРасход.ДатаЧекаККМ,
	|	ЗаявкаНаКассовыйРасход.Организация,
	|	""Заявка на кассовый расход (сокращенная)"",
	|	ЗаявкаНаКассовыйРасход.Дата,
	|	ЗаявкаНаКассовыйРасход.Номер,
	|	ЗаявкаНаКассовыйРасход.СистемаНалогообложенияЧекаККМ,
	|	ЗаявкаНаКассовыйРасход.КассаККМ,
	|	ЗаявкаНаКассовыйРасход.ТипРасчета,
	|	ЗаявкаНаКассовыйРасход.Контрагент,
	|	ЗаявкаНаКассовыйРасход.Договор,
	|	ЗаявкаНаКассовыйРасход.СуммаДокумента
	|ИЗ
	|	Документ.ЗаявкаНаКассовыйРасходСокращенная КАК ЗаявкаНаКассовыйРасход
	|ГДЕ
	|	ЗаявкаНаКассовыйРасход.Организация = &Организация
	|	И ЗаявкаНаКассовыйРасход.КассаККМ = &КассаККМ
	|	И ЗаявкаНаКассовыйРасход.Дата МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И ЗаявкаНаКассовыйРасход.ПометкаУдаления = ЛОЖЬ
	|	И ЗаявкаНаКассовыйРасход.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПлатежноеПоручение.Ссылка,
	|	ПлатежноеПоручение.НомерЧекаККМ,
	|	ПлатежноеПоручение.ДатаЧекаККМ,
	|	ПлатежноеПоручение.Организация,
	|	""Платежное поручение"",
	|	ПлатежноеПоручение.Дата,
	|	ПлатежноеПоручение.Номер,
	|	ПлатежноеПоручение.СистемаНалогообложенияЧекаККМ,
	|	ПлатежноеПоручение.КассаККМ,
	|	ПлатежноеПоручение.ТипРасчета,
	|	ПлатежноеПоручение.Контрагент,
	|	ПлатежноеПоручение.Договор,
	|	ПлатежноеПоручение.СуммаДокумента
	|ИЗ
	|	Документ.ПлатежноеПоручение КАК ПлатежноеПоручение
	|ГДЕ
	|	ПлатежноеПоручение.Организация = &Организация
	|	И ПлатежноеПоручение.КассаККМ = &КассаККМ
	|	И ПлатежноеПоручение.Дата МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И ПлатежноеПоручение.ПометкаУдаления = ЛОЖЬ
	|	И ПлатежноеПоручение.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекиККМДляРеестраПлатежейЧекиККМ.Ссылка,
	|	ЧекиККМДляРеестраПлатежейЧекиККМ.НомерЧекаККМ,
	|	ЧекиККМДляРеестраПлатежейЧекиККМ.ДатаЧекаККМ,
	|	ЧекиККМДляРеестраПлатежейЧекиККМ.Ссылка.Организация,
	|	""Реестр безналичных платежей"",
	|	ЧекиККМДляРеестраПлатежейЧекиККМ.Ссылка.Дата,
	|	ЧекиККМДляРеестраПлатежейЧекиККМ.Ссылка.Номер,
	|	ЧекиККМДляРеестраПлатежейЧекиККМ.Ссылка.СистемаНалогообложенияЧекаККМ,
	|	ЧекиККМДляРеестраПлатежейЧекиККМ.Ссылка.КассаККМ,
	|	ЧекиККМДляРеестраПлатежейЧекиККМ.ТипРасчета,
	|	ЧекиККМДляРеестраПлатежейЧекиККМ.Контрагент,
	|	"""",
	|	ЧекиККМДляРеестраПлатежейЧекиККМ.Сумма
	|ИЗ
	|	Документ.ЧекиККМДляРеестраПлатежей.ЧекиККМ КАК ЧекиККМДляРеестраПлатежейЧекиККМ
	|ГДЕ
	|	ЧекиККМДляРеестраПлатежейЧекиККМ.Ссылка.Организация = &Организация
	|	И ЧекиККМДляРеестраПлатежейЧекиККМ.Ссылка.КассаККМ = &КассаККМ
	|	И ЧекиККМДляРеестраПлатежейЧекиККМ.Ссылка.Дата МЕЖДУ &ДатаНачалаОтбора И &ДатаОкончанияОтбора
	|	И ЧекиККМДляРеестраПлатежейЧекиККМ.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ЧекиККМДляРеестраПлатежейЧекиККМ.СтатусЧекаККМ = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробитый)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ФискальныеОперацииКассыККМ.ДокументОснование,
	|	ФискальныеОперацииКассыККМ.НомерЧекаККМ,
	|	ФискальныеОперацииКассыККМ.ДатаЧекаККМ,
	|	ФискальныеОперацииКассыККМ.Организация,
	|	ФискальныеОперацииКассыККМ.ВидДокументаОснования,
	|	ФискальныеОперацииКассыККМ.ДатаДокументаОснования,
	|	ФискальныеОперацииКассыККМ.НомерДокументаОснования,
	|	ФискальныеОперацииКассыККМ.СНО,
	|	ФискальныеОперацииКассыККМ.КассаККМ,
	|	ФискальныеОперацииКассыККМ.ТипРасчета,
	|	ФискальныеОперацииКассыККМ.Контрагент,
	|	ФискальныеОперацииКассыККМ.Договор,
	|	ФискальныеОперацииКассыККМ.СуммаДокумента
	|ИЗ
	|	ФискальныеОперацииКассыККМ КАК ФискальныеОперацииКассыККМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОРасчетныхДокументах.Ссылка КАК ДокументОснование,
	|	СведенияОРасчетныхДокументах.НомерЧекаККМ КАК НомерЧекаККМ,
	|	СведенияОРасчетныхДокументах.ДатаЧекаККМ КАК ДатаЧекаККМ,
	|	СведенияОРасчетныхДокументах.Организация КАК Организация,
	|	СведенияОРасчетныхДокументах.ВидДокументаОснования КАК ВидДокументаОснования,
	|	СведенияОРасчетныхДокументах.ДатаДокументаОснования КАК ДатаДокументаОснования,
	|	СведенияОРасчетныхДокументах.НомерДокументаОснования КАК НомерДокументаОснования,
	|	СведенияОРасчетныхДокументах.СНО КАК СНО,
	|	СведенияОРасчетныхДокументах.КассаККМ КАК КассаККМ,
	|	ВЫБОР
	|		КОГДА СведенияОРасчетныхДокументах.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ПриходДенежныхСредств)
	|			ТОГДА ""Приход""
	|		КОГДА СведенияОРасчетныхДокументах.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратРасходаДенежныхСредств)
	|			ТОГДА ""Возврат расхода""
	|		КОГДА СведенияОРасчетныхДокументах.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств)
	|			ТОГДА ""Возврат""
	|		КОГДА СведенияОРасчетныхДокументах.ТипРасчета = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетаДенежнымиСредствами.РасходДенежныхСредств)
	|			ТОГДА ""Расход""
	|		ИНАЧЕ СведенияОРасчетныхДокументах.ТипРасчета
	|	КОНЕЦ КАК ТипРасчета,
	|	СведенияОРасчетныхДокументах.Контрагент КАК Контрагент,
	|	СведенияОРасчетныхДокументах.Договор КАК Основание,
	|	СведенияОРасчетныхДокументах.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	СведенияОРасчетныхДокументах КАК СведенияОРасчетныхДокументах
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЧекаККМ,
	|	ДатаЧекаККМ";

	Возврат ТекстЗапроса;
	
КонецФункции	

#КонецЕсли
